# tutorial

In [1]:
import pandas as pd

In [2]:
print("hello world")

hello world

In [34]:
df = pd.DataFrame([[1, 2, 3,], [4,5,6],[7,8,9],[10, 11, 12]], columns = ["A", "B","C"],index = ["x","y","z","p"])

In [21]:
df.tail()

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [36]:
df.head()

    A   B   C
x   1   2   3
y   4   5   6
z   7   8   9
p  10  11  12

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [25]:
df.index

Index(['x', 'y', 'z'], dtype='object')

In [37]:
df.describe()

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [29]:
df.nunique()

A    3
B    3
C    3
dtype: int64

In [35]:
df.shape

(4, 3)

In [39]:
df["A"].unique()

array([ 1,  4,  7, 10])

In [44]:
coffee = pd.read_csv('coffee.csv')

In [45]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [46]:
coffee.tail()

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35